# Pandas Example3

## numpy, pandas series example

In [1]:
import numpy as np
import pandas as df

In [4]:
s = df.Series(np.random.randn(5))
print(s)

0    0.519777
1    0.166146
2    0.667982
3    0.060033
4   -0.560023
dtype: float64

In [5]:
s = df.Series(np.random.randn(5), index=['A','B','C','D','E'])
print(s)

A    1.338696
B    1.428997
C    1.500577
D   -0.723456
E    0.906603
dtype: float64

In [7]:
d = {'a':0,'b':1,'c':2}
print(df.Series(d))

a    0
b    1
c    2
dtype: int64

In [9]:
data2 = [{'name':'MARK'},{'name':'ERIC'},{'name':'JENNIFER'}]

In [10]:
df2 = df.DataFrame(data2)

In [12]:
df2['age'] = [10,11,12]

In [13]:
df2

       name  age
0      MARK   10
1      ERIC   11
2  JENNIFER   12

In [16]:
data3 = [{'addr':u'서울'},{'addr':u'경기'},{'addr':u'인천'}]
df3 = df.DataFrame(data3)

In [17]:
df3

  addr
0   서울
1   경기
2   인천

In [22]:
# Merge
df4 = df.merge(df2, df3, left_index = True, right_index = True)
df4

       name  age addr
0      MARK   10   서울
1      ERIC   11   경기
2  JENNIFER   12   인천

## date_range()

In [24]:
df.date_range(start='2019-01-01',end='2019-01-07')

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [25]:
df.date_range(start='2019-01-01', periods = 7)

DatetimeIndex(['2019-01-01', '2019-01-02', '2019-01-03', '2019-01-04',
               '2019-01-05', '2019-01-06', '2019-01-07'],
              dtype='datetime64[ns]', freq='D')

In [27]:
df.date_range(start='2019-01-01', periods = 5, freq = 'W')

DatetimeIndex(['2019-01-06', '2019-01-13', '2019-01-20', '2019-01-27',
               '2019-02-03'],
              dtype='datetime64[ns]', freq='W-SUN')